#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.ecs-log-group: Refreshing state... [id=/ecs/ecs-runner-task-def]
aws_appautoscaling_target.dev_to_target: Refreshing state... [id=service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_security_group.ecs_sg: Refreshing state... [id=sg-0393461826a5b8a29]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-runner_ecs_task_execution_role:password-policy-secretsmanager]
aws_secretsmanager_secret.REPO: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht]
aws_appautoscaling_policy.dev_to_cpu: Refreshing state... [id=dev-to-cpu]
aws_appautoscaling_policy.dev_to_memory: Refreshing state... [id=dev-to-memory]
aws_ecs_task_definition.task_definition: Refreshing state... [id=ecs-runner-task-def]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-0e7fc431ff5a103e9]
aws_secretsmanager_secret.PAT: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt]
aws_secretsmanager_secret.AWS_ACCESS_KEY_ID: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu]
aws_secretsmanager_secret.ORG: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-runner_ecs_task_execution_role]
aws_vpc.vpc: Refreshing state... [id=vpc-07498bf92e0c86bd9]
aws_ecr_repository.ECR_repository: Refreshing state... [id=ecs-runner]
aws_secretsmanager_secret.AWS_SECRET_ACCESS_KEY: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht]
aws_secretsmanager_secret.AWS_DEFAULT_REGION: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744423200000001]
aws_iam_role_policy_attachment.admin-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744458800000002]
aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|52348464-5E84-4A07-9A5D-0099F4651736]
aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|5201D725-F9F0-41EF-9006-31558A048E0D]
aws_secretsmanager_secret_version.AWS_DEFAULT_REGION_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc|82B59D96-9E50-4ABE-B34B-931684C50975]
aws_internet_gateway.int_gateway: Refreshing state... [id=igw-01c1b694a42658781]
aws_subnet.private_subnet: Refreshing state... [id=subnet-04f6bd53f3b41f090]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0685110895bc6f5ee]
aws_route_table.route_table_public: Refreshing state... [id=rtb-063216b5f5f2501f8]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0080321254bfa3ed1]
aws_route_table_association.assoc_1: Refreshing state... [id=rtbassoc-0db31f2d7338db67b]
aws_route_table.route_table_private: Refreshing state... [id=rtb-00757056dc1d18288]
aws_route_table_association.assoc_2: Refreshing state... [id=rtbassoc-09bca5dc650e00b1b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.dev_to_cpu will be destroyed
  # (because aws_appautoscaling_policy.dev_to_cpu is not in configuration)
  - resource "aws_appautoscaling_policy" "dev_to_cpu" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:ap-south-1:508656221602:alarm:TargetTracking-service/ecs-runner-cluster/ecs-runner-ecs-service-AlarmHigh-d14395bc-b2bb-4f52-9b1f-97ed689b2a1d",
          - "arn:aws:cloudwatch:ap-south-1:508656221602:alarm:TargetTracking-service/ecs-runner-cluster/ecs-runner-ecs-service-AlarmLow-9cbc6339-1b45-4468-b346-7bcf3792d2c6",
        ] -> null
      - arn                = "arn:aws:autoscaling:ap-south-1:508656221602:scalingPolicy:9a368a7a-e9a0-4c1f-909e-fc681a40dabe:resource/ecs/service/ecs-runner-cluster/ecs-runner-ecs-service:policyName/dev-to-cpu" -> null
      - id                 = "dev-to-cpu" -> null
      - name               = "dev-to-cpu" -> null
      - policy_type        = "TargetTrackingScaling" -> null
      - resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - target_tracking_scaling_policy_configuration {
          - disable_scale_in   = false -> null
          - scale_in_cooldown  = 0 -> null
          - scale_out_cooldown = 0 -> null
          - target_value       = 60 -> null

          - predefined_metric_specification {
              - predefined_metric_type = "ECSServiceAverageCPUUtilization" -> null
            }
        }
    }

  # aws_appautoscaling_policy.dev_to_memory will be destroyed
  # (because aws_appautoscaling_policy.dev_to_memory is not in configuration)
  - resource "aws_appautoscaling_policy" "dev_to_memory" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:ap-south-1:508656221602:alarm:TargetTracking-service/ecs-runner-cluster/ecs-runner-ecs-service-AlarmHigh-3d47cec5-0b3c-4396-a223-d87cfee70442",
          - "arn:aws:cloudwatch:ap-south-1:508656221602:alarm:TargetTracking-service/ecs-runner-cluster/ecs-runner-ecs-service-AlarmLow-fbc87414-c9ac-426d-806b-aa2919375759",
        ] -> null
      - arn                = "arn:aws:autoscaling:ap-south-1:508656221602:scalingPolicy:9a368a7a-e9a0-4c1f-909e-fc681a40dabe:resource/ecs/service/ecs-runner-cluster/ecs-runner-ecs-service:policyName/dev-to-memory" -> null
      - id                 = "dev-to-memory" -> null
      - name               = "dev-to-memory" -> null
      - policy_type        = "TargetTrackingScaling" -> null
      - resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - target_tracking_scaling_policy_configuration {
          - disable_scale_in   = false -> null
          - scale_in_cooldown  = 0 -> null
          - scale_out_cooldown = 0 -> null
          - target_value       = 80 -> null

          - predefined_metric_specification {
              - predefined_metric_type = "ECSServiceAverageMemoryUtilization" -> null
            }
        }
    }

  # aws_appautoscaling_target.dev_to_target will be destroyed
  # (because aws_appautoscaling_target.dev_to_target is not in configuration)
  - resource "aws_appautoscaling_target" "dev_to_target" {
      - arn                = "arn:aws:application-autoscaling:ap-south-1:508656221602:scalable-target/0ec59a368a7ae9a04c1f909efc681a40dabe" -> null
      - id                 = "service/ecs-runner-cluster/ecs-runner-ecs-service" -> null
      - max_capacity       = 2 -> null
      - min_capacity       = 1 -> null
      - resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service" -> null
      - role_arn           = "arn:aws:iam::508656221602:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # aws_cloudwatch_log_group.ecs-log-group will be destroyed
  # (because aws_cloudwatch_log_group.ecs-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "ecs-log-group" {
      - arn               = "arn:aws:logs:ap-south-1:508656221602:log-group:/ecs/ecs-runner-task-def" -> null
      - id                = "/ecs/ecs-runner-task-def" -> null
      - name              = "/ecs/ecs-runner-task-def" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_ecs_service.ecs_service will be destroyed
  # (because aws_ecs_service.ecs_service is not in configuration)
  - resource "aws_ecs_service" "ecs_service" {
      - cluster                            = "arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:ap-south-1:508656221602:service/ecs-runner-cluster/ecs-runner-ecs-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "ecs-runner-ecs-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def:2" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0393461826a5b8a29",
            ] -> null
          - subnets          = [
              - "subnet-04f6bd53f3b41f090",
            ] -> null
        }
    }

  # aws_ecs_task_definition.task_definition will be destroyed
  # (because aws_ecs_task_definition.task_definition is not in configuration)
  - resource "aws_ecs_task_definition" "task_definition" {
      - arn                      = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def:2" -> null
      - arn_without_revision     = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "./start.sh",
                    ]
                  - cpu              = 256
                  - environment      = []
                  - essential        = true
                  - image            = "508656221602.dkr.ecr.ap-south-1.amazonaws.com/ecs-runner:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/ecs-runner-task-def"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "ecs-runner"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "PAT"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt"
                        },
                      - {
                          - name      = "ORG"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u"
                        },
                      - {
                          - name      = "REPO"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht"
                        },
                      - {
                          - name      = "AWS_DEFAULT_REGION"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::508656221602:role/ecs-runner_ecs_task_execution_role" -> null
      - family                   = "ecs-runner-task-def" -> null
      - id                       = "ecs-runner-task-def" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::508656221602:role/ecs-runner_ecs_task_execution_role" -> null
    }

  # aws_iam_role_policy.password_policy_secretsmanager will be destroyed
  # (because aws_iam_role_policy.password_policy_secretsmanager is not in configuration)
  - resource "aws_iam_role_policy" "password_policy_secretsmanager" {
      - id     = "ecs-runner_ecs_task_execution_role:password-policy-secretsmanager" -> null
      - name   = "password-policy-secretsmanager" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "ecs-runner_ecs_task_execution_role" -> null
    }

  # aws_route_table.route_table_private will be updated in-place
  ~ resource "aws_route_table" "route_table_private" {
        id               = "rtb-00757056dc1d18288"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0080321254bfa3ed1"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0080321254bfa3ed1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ecs-runner_private"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "AWS_ACCESS_KEY_ID_version" {
      ~ arn            = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|52348464-5E84-4A07-9A5D-0099F4651736" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "52348464-5E84-4A07-9A5D-0099F4651736" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "AWS_SECRET_ACCESS_KEY_version" {
      ~ arn            = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|5201D725-F9F0-41EF-9006-31558A048E0D" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "5201D725-F9F0-41EF-9006-31558A048E0D" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.ORG_version will be created
  + resource "aws_secretsmanager_secret_version" "ORG_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.PAT_version will be created
  + resource "aws_secretsmanager_secret_version" "PAT_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.REPO_version will be created
  + resource "aws_secretsmanager_secret_version" "REPO_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.ecs_sg will be destroyed
  # (because aws_security_group.ecs_sg is not in configuration)
  - resource "aws_security_group" "ecs_sg" {
      - arn                    = "arn:aws:ec2:ap-south-1:508656221602:security-group/sg-0393461826a5b8a29" -> null
      - description            = "Allow incoming traffic for ecs" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0393461826a5b8a29" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "ecs-runner-ecs-sg" -> null
      - owner_id               = "508656221602" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ecs-runner_ecs_sg"
        } -> null
      - tags_all               = {
          - "Name" = "ecs-runner_ecs_sg"
        } -> null
      - vpc_id                 = "vpc-07498bf92e0c86bd9" -> null
    }

Plan: 5 to add, 1 to change, 10 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @pkj1993, Action: `pull_request`*